Repository: Voiinov/TeA
Catalog: locale/*/LC_MESSAGES/*-0.0.0.po
Languages: uk_ua

source: Email already taken!
uk_ua: Електронна пошта вже зайнята!

source: Field is required.
uk_ua: Обов'язкове поле.

source: Invalid email format.
uk_ua: Недійсний формат електронної пошти.

source: Authentication
uk_ua: Аутентифікація

source: Registration
uk_ua: Реєстрація

source: Please enter a email address
uk_ua: Будь ласка, введіть адресу електронної пошти

source: Please enter a valid email address
uk_ua: Будь ласка, введіть дійсну адресу електронної пошти

source: Please provide a password
uk_ua: Введіть пароль

source: Your password must be at least 5 characters long
uk_ua: Ваш пароль має містити принаймні 5 символів

source: The field cannot be empty
uk_ua: Поле не може бути порожнім

source: Must be at least 3 characters long
uk_ua: Має бути щонайменше 3 символи

source: Please accept our terms
uk_ua: Будь ласка, прийміть наші умови

source: Sign in to start your session
uk_ua: Увійдіть, щоб почати роботу

source: Email
uk_ua: Електронна пошта

source: Password
uk_ua: Пароль

source: Remember Me
uk_ua: Запам'ятати

source: Sign In
uk_ua: Вхід

source: OR
uk_ua: АБО

source: Sign in using Facebook
uk_ua: Авторизація через Facebook

source: Sign in using Google
uk_ua: Авторизація через Google

source: I forgot my password
uk_ua: Не пам'ятаю пароль

source: Register a new membership
uk_ua: Зареєструватись

source: Last name
uk_ua: Прізвище

source: First name
uk_ua: Ім'я

source: Middle name
uk_ua: По батькові

source: I agree to the <a href="#">terms</a>
uk_ua: Я погоджуюсь з <a href="#">умовами</a>

source: Register
uk_ua: Зареєструватися

source: Sign up using Facebook
uk_ua: Авторизація через Facebook

source: Sign up using Google
uk_ua: Авторизація через Google

source: I already have an account
uk_ua: Я вже маю акаунт

source: Database connection error:
uk_ua: Помилка підключення до бази даних:

source: Database query error:
uk_ua: Помилка запиту до бази даних:
