<?php

namespace App\Helper;

class Writer
{
    public function abbreviation(string $str): string
    {
        $str = str_replace(["I підгрупа", "ІІ підгрупа", "І підгрупа", "ІІ підгрупа"], ["1", "2", "1", "2"], $str);
        $str = preg_replace("/\s{2,}|[()]|\B(\w)|\s/u", "", $str);
        return mb_strtoupper($str);
    }

    /**
     * Повертає назву місяця за відміком
     * @param int $m номер місяця
     * @param int $form
     * 0-скорочення, 1-назвиний, 2-родовий, 3-давальний, 4-знахідний, 5-орудний, 6-місцевий, 7-кличний
     * @return string
     */
    public function monthName(int $m, int $form = 1): string
    {
        $month = [
            1 => ["Січ.", "Січень", "Січня", "Січню", "Січень", "Січнем", "Січні", "Січню"],
            2 => ["Лют.", "Лютий", "Лютого", "Лютому", "Лютого", "Лютим", "Лютому", "Лютий"],
            3 => ["Берез.", "Березень", "Березня", "Березню", "Березень", "Березнем", "Березні", "Березню"],
            4 => ["Квіт.", "Квітень", "Квітня", "Квітню", "Квітень", "Квітнем", "Квітні", "Квітню"],
            5 => ["Трав.", "Травень", "Травня", "Травню", "Травень", "Травнем", "Травні", "Травню"],
            6 => ["Черв.", "Червень", "Червня", "Червню", "Червень", "Червнем", "Червні", "Червню"],
            7 => ["Лип.", "Липень", "Липня", "Липню", "Липень", "Липнем", "Липні", "Липню"],
            8 => ["Серп.", "Серпень", "Серпня", "Серпню", "Серпень", "Серпнем", "Серпні", "Серпню"],
            9 => ["Верес.", "Вересень", "Вересня", "Вересню", "Вересень", "Вереснем", "Веересні", "Вересню"],
            10 => ["Жовт.", "Жовтень", "Жовтня", "Жовтню", "Жовтень", "Жовтнем", "Жовтні", "Жовтню"],
            11 => ["Листоп.", "Листопад", "Листопада", "Листопаду", "Листопад", "Листопадом", "Листопаді", "Листопаде"],
            12 => ["Груд.", "Грудень", "Грудня", "Грудню", "Грудень", "Груднем", "Грудні", "Грудню"]
        ];
        return $month[$m][$form] ?? $m;
    }
    public function dayName(int $d, int $form = 1): string
    {
        $week = [
            0 => ["Нд", "Неділя", "Неділі", "Неділі", "Неділю", "Неділею", "Неділі", "Неділе"],
            1 => ["Пн","Понеділок", "Понеділка", "Понеділку", "Понеділок", "Понеділком", "Понеділку", "Понеділку"],
            2 => ["Вт", "Вівторок", "Вівторок", "Вівторок", "Вівторок", "Вівторок", "Вівторок", "Вівторок"],
            3 => ["Ср", "Середа", "Середи", "Середі", "Середу", "Средою", "Середі", "Середо"],
            4 => ["Чт", "Четвер", "Четверга", "Четвергу", "Четвер", "Четвергом", "Четвергу", "Четвергу"],
            5 => ["Пт", "П'ятниця", "П'ятниці", "П'ятниці", "П'ятницю", "П'ятницею", "П'ятниці", "П'ятнице"],
            6 => ["Сб", "Субота", "Суботи", "Суботі", "Суботу", "Суботою", "Суботі", "Субото"],
            7 => ["Нд", "Неділя", "Неділі", "Неділі", "Неділю", "Неділею", "Неділі", "Неділе"]
        ];
        return $week[$d][$form] ?? $d;
    }

}